## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 4 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                               NAME                               |
|----------|------------------------------------------------------------------|
| update   | `aws_iam_policy.api`                                             |
|          | `aws_iam_policy.ecr`                                             |
|          | `aws_lambda_alias.api_latest`                                    |
|          | `aws_lambda_function.api`                                        |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]`                |
| delete   | `aws_secretsmanager_secret.lambda-new-relic-license-key`         |
|          | `aws_secretsmanager_secret_version.lambda-new-relic-license-key` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
02:41:30.004 STDOUT terraform:   ~ update in-place
02:41:30.004 STDOUT terraform:   - destroy
02:41:30.004 STDOUT terraform: -/+ destroy and then create replacement
02:41:30.004 STDOUT terraform:  <= read (data resources)
02:41:30.004 STDOUT terraform: Terraform will perform the following actions:
02:41:30.004 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
02:41:30.004 STDOUT terraform:   # (depends on a resource or a module with changes pending)
02:41:30.004 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
02:41:30.004 STDOUT terraform:       + id            = (known after apply)
02:41:30.004 STDOUT terraform:       + json          = (known after apply)
02:41:30.004 STDOUT terraform:       + minified_json = (known after apply)
02:41:30.004 STDOUT terraform:       + statement {
02:41:30.004 STDOUT terraform:           + actions   = [
02:41:30.004 STDOUT terraform:               + "ecr:GetAuthorizationToken",
02:41:30.004 STDOUT terraform:             ]
02:41:30.004 STDOUT terraform:           + effect    = "Allow"
02:41:30.004 STDOUT terraform:           + resources = [
02:41:30.004 STDOUT terraform:               + "*",
02:41:30.004 STDOUT terraform:             ]
02:41:30.005 STDOUT terraform:           + sid       = "GetAuthorizationToken"
02:41:30.005 STDOUT terraform:         }
02:41:30.005 STDOUT terraform:       + statement {
02:41:30.005 STDOUT terraform:           + actions   = [
02:41:30.005 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
02:41:30.005 STDOUT terraform:               + "ecr:BatchGetImage",
02:41:30.005 STDOUT terraform:               + "ecr:CompleteLayerUpload",
02:41:30.005 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
02:41:30.005 STDOUT terraform:               + "ecr:InitiateLayerUpload",
02:41:30.005 STDOUT terraform:               + "ecr:PutImage",
02:41:30.005 STDOUT terraform:               + "ecr:UploadLayerPart",
02:41:30.005 STDOUT terraform:             ]
02:41:30.005 STDOUT terraform:           + effect    = "Allow"
02:41:30.005 STDOUT terraform:           + resources = [
02:41:30.005 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
02:41:30.005 STDOUT terraform:             ]
02:41:30.005 STDOUT terraform:           + sid       = "AllowPushPull"
02:41:30.005 STDOUT terraform:         }
02:41:30.005 STDOUT terraform:       + statement {
02:41:30.005 STDOUT terraform:           + actions   = [
02:41:30.005 STDOUT terraform:               + "lambda:GetAlias",
02:41:30.005 STDOUT terraform:               + "lambda:GetFunction",
02:41:30.005 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
02:41:30.005 STDOUT terraform:               + "lambda:ListAliases",
02:41:30.005 STDOUT terraform:               + "lambda:ListVersionsByFunction",
02:41:30.005 STDOUT terraform:               + "lambda:PublishVersion",
02:41:30.005 STDOUT terraform:               + "lambda:UpdateAlias",
02:41:30.005 STDOUT terraform:               + "lambda:UpdateFunctionCode",
02:41:30.005 STDOUT terraform:             ]
02:41:30.005 STDOUT terraform:           + effect    = "Allow"
02:41:30.005 STDOUT terraform:           + resources = [
02:41:30.005 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
02:41:30.005 STDOUT terraform:             ]
02:41:30.005 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
02:41:30.006 STDOUT terraform:         }
02:41:30.006 STDOUT terraform:       + statement {
02:41:30.006 STDOUT terraform:           + actions   = [
02:41:30.006 STDOUT terraform:               + "lambda:GetLayerVersion",
02:41:30.006 STDOUT terraform:             ]
02:41:30.006 STDOUT terraform:           + effect    = "Allow"
02:41:30.006 STDOUT terraform:           + resources = [
02:41:30.006 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
02:41:30.006 STDOUT terraform:             ]
02:41:30.006 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
02:41:30.006 STDOUT terraform:         }
02:41:30.006 STDOUT terraform:     }
02:41:30.006 STDOUT terraform:   # aws_iam_policy.api will be updated in-place
02:41:30.006 STDOUT terraform:   ~ resource "aws_iam_policy" "api" {
02:41:30.006 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/notify-api"
02:41:30.006 STDOUT terraform:         name             = "notify-api"
02:41:30.006 STDOUT terraform:       ~ policy           = jsonencode(
02:41:30.006 STDOUT terraform:           ~ {
02:41:30.006 STDOUT terraform:               ~ Statement = [
02:41:30.006 STDOUT terraform:                     # (5 unchanged elements hidden)
02:41:30.006 STDOUT terraform:                     {
02:41:30.006 STDOUT terraform:                         Action   = "ssm:GetParameters"
02:41:30.006 STDOUT terraform:                         Effect   = "Allow"
02:41:30.006 STDOUT terraform:                         Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/ENVIRONMENT_VARIABLES"
02:41:30.006 STDOUT terraform:                     },
02:41:30.006 STDOUT terraform:                   ~ {
02:41:30.006 STDOUT terraform:                       ~ Resource = [
02:41:30.006 STDOUT terraform:                           - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v",
02:41:30.006 STDOUT terraform:                           - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:LAMBDA_NEW_RELIC_LICENSE_KEY-T1PN3G",
02:41:30.007 STDOUT terraform:                         ] -> "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v"
02:41:30.007 STDOUT terraform:                         # (2 unchanged attributes hidden)
02:41:30.007 STDOUT terraform:                     },
02:41:30.007 STDOUT terraform:                     {
02:41:30.007 STDOUT terraform:                         Action   = [
02:41:30.007 STDOUT terraform:                             "tag:GetResources",
02:41:30.007 STDOUT terraform:                             "lambda:ListTags",
02:41:30.007 STDOUT terraform:                             "lambda:ListFunctions",
02:41:30.007 STDOUT terraform:                             "lambda:ListEventSourceMappings",
02:41:30.007 STDOUT terraform:                             "lambda:ListAliases",
02:41:30.007 STDOUT terraform:                             "lambda:GetAccountSettings",
02:41:30.007 STDOUT terraform:                             "config:ListDiscoveredResources",
02:41:30.007 STDOUT terraform:                             "config:BatchGetResourceConfig",
02:41:30.007 STDOUT terraform:                             "cloudwatch:ListMetrics",
02:41:30.007 STDOUT terraform:                             "cloudwatch:GetMetricStatistics",
02:41:30.007 STDOUT terraform:                             "cloudwatch:GetMetricData",
02:41:30.007 STDOUT terraform:                         ]
02:41:30.007 STDOUT terraform:                         Effect   = "Allow"
02:41:30.007 STDOUT terraform:                         Resource = "*"
02:41:30.007 STDOUT terraform:                     },
02:41:30.007 STDOUT terraform:                     # (1 unchanged element hidden)
02:41:30.007 STDOUT terraform:                 ]
02:41:30.007 STDOUT terraform:                 # (1 unchanged attribute hidden)
02:41:30.007 STDOUT terraform:             }
02:41:30.007 STDOUT terraform:         )
02:41:30.007 STDOUT terraform:         tags             = {}
02:41:30.007 STDOUT terraform:         # (7 unchanged attributes hidden)
02:41:30.007 STDOUT terraform:     }
02:41:30.007 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
02:41:30.008 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
02:41:30.008 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
02:41:30.008 STDOUT terraform:         name             = "ecr-api-lambda-access"
02:41:30.008 STDOUT terraform:       ~ policy           = jsonencode(
02:41:30.008 STDOUT terraform:             {
02:41:30.008 STDOUT terraform:               - Statement = [
02:41:30.008 STDOUT terraform:                   - {
02:41:30.008 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
02:41:30.008 STDOUT terraform:                       - Effect   = "Allow"
02:41:30.008 STDOUT terraform:                       - Resource = "*"
02:41:30.008 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
02:41:30.008 STDOUT terraform:                     },
02:41:30.008 STDOUT terraform:                   - {
02:41:30.008 STDOUT terraform:                       - Action   = [
02:41:30.008 STDOUT terraform:                           - "ecr:UploadLayerPart",
02:41:30.008 STDOUT terraform:                           - "ecr:PutImage",
02:41:30.008 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
02:41:30.008 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
02:41:30.008 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
02:41:30.008 STDOUT terraform:                           - "ecr:BatchGetImage",
02:41:30.008 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
02:41:30.008 STDOUT terraform:                         ]
02:41:30.008 STDOUT terraform:                       - Effect   = "Allow"
02:41:30.008 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
02:41:30.008 STDOUT terraform:                       - Sid      = "AllowPushPull"
02:41:30.008 STDOUT terraform:                     },
02:41:30.008 STDOUT terraform:                   - {
02:41:30.008 STDOUT terraform:                       - Action   = [
02:41:30.008 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
02:41:30.008 STDOUT terraform:                           - "lambda:UpdateAlias",
02:41:30.009 STDOUT terraform:                           - "lambda:PublishVersion",
02:41:30.009 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
02:41:30.009 STDOUT terraform:                           - "lambda:ListAliases",
02:41:30.009 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
02:41:30.009 STDOUT terraform:                           - "lambda:GetFunction",
02:41:30.009 STDOUT terraform:                           - "lambda:GetAlias",
02:41:30.009 STDOUT terraform:                         ]
02:41:30.009 STDOUT terraform:                       - Effect   = "Allow"
02:41:30.009 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
02:41:30.009 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
02:41:30.009 STDOUT terraform:                     },
02:41:30.009 STDOUT terraform:                   - {
02:41:30.009 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
02:41:30.009 STDOUT terraform:                       - Effect   = "Allow"
02:41:30.009 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
02:41:30.009 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
02:41:30.009 STDOUT terraform:                     },
02:41:30.009 STDOUT terraform:                 ]
02:41:30.009 STDOUT terraform:               - Version   = "2012-10-17"
02:41:30.009 STDOUT terraform:             }
02:41:30.009 STDOUT terraform:         ) -> (known after apply)
02:41:30.009 STDOUT terraform:         tags             = {}
02:41:30.009 STDOUT terraform:         # (7 unchanged attributes hidden)
02:41:30.009 STDOUT terraform:     }
02:41:30.009 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
02:41:30.009 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
02:41:30.009 STDOUT terraform:       ~ function_version = "1768" -> (known after apply)
02:41:30.009 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
02:41:30.010 STDOUT terraform:         name             = "latest"
02:41:30.010 STDOUT terraform:         # (5 unchanged attributes hidden)
02:41:30.010 STDOUT terraform:     }
02:41:30.010 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
02:41:30.010 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
02:41:30.010 STDOUT terraform:         id                             = "api-lambda"
02:41:30.010 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1768" -> (known after apply)
02:41:30.010 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1768/invocations" -> (known after apply)
02:41:30.010 STDOUT terraform:         tags                           = {}
02:41:30.010 STDOUT terraform:       ~ version                        = "1768" -> (known after apply)
02:41:30.010 STDOUT terraform:         # (27 unchanged attributes hidden)
02:41:30.010 STDOUT terraform:       ~ environment {
02:41:30.010 STDOUT terraform:           ~ variables = {
02:41:30.010 STDOUT terraform:               - "NEW_RELIC_EXTENSION_LOGS_ENABLED"       = "true" -> null
02:41:30.010 STDOUT terraform:               - "NEW_RELIC_EXTENSION_SEND_FUNCTION_LOGS" = "true" -> null
02:41:30.010 STDOUT terraform:               - "NEW_RELIC_LAMBDA_EXTENSION_ENABLED"     = "true" -> null
02:41:30.010 STDOUT terraform:               - "NEW_RELIC_LAMBDA_HANDLER"               = "application.handler" -> null
02:41:30.010 STDOUT terraform:               + "NEW_RELIC_SERVERLESS_MODE_ENABLED"      = "false"
02:41:30.010 STDOUT terraform:                 # (16 unchanged elements hidden)
02:41:30.010 STDOUT terraform:             }
02:41:30.010 STDOUT terraform:         }
02:41:30.010 STDOUT terraform:         # (4 unchanged blocks hidden)
02:41:30.010 STDOUT terraform:     }
02:41:30.010 STDOUT terraform:   # aws_secretsmanager_secret.lambda-new-relic-license-key will be destroyed
02:41:30.010 STDOUT terraform:   # (because aws_secretsmanager_secret.lambda-new-relic-license-key is not in configuration)
02:41:30.011 STDOUT terraform:   - resource "aws_secretsmanager_secret" "lambda-new-relic-license-key" {
02:41:30.011 STDOUT terraform:       - arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:LAMBDA_NEW_RELIC_LICENSE_KEY-T1PN3G" -> null
02:41:30.011 STDOUT terraform:       - description                    = "The New Relic license key, for sending telemetry" -> null
02:41:30.011 STDOUT terraform:       - force_overwrite_replica_secret = false -> null
02:41:30.011 STDOUT terraform:       - id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:LAMBDA_NEW_RELIC_LICENSE_KEY-T1PN3G" -> null
02:41:30.011 STDOUT terraform:       - name                           = "LAMBDA_NEW_RELIC_LICENSE_KEY" -> null
02:41:30.011 STDOUT terraform:       - recovery_window_in_days        = 0 -> null
02:41:30.011 STDOUT terraform:       - region                         = "ca-central-1" -> null
02:41:30.011 STDOUT terraform:       - tags                           = {} -> null
02:41:30.011 STDOUT terraform:       - tags_all                       = {} -> null
02:41:30.011 STDOUT terraform:         # (3 unchanged attributes hidden)
02:41:30.011 STDOUT terraform:     }
02:41:30.011 STDOUT terraform:   # aws_secretsmanager_secret_version.lambda-new-relic-license-key will be destroyed
02:41:30.011 STDOUT terraform:   # (because aws_secretsmanager_secret_version.lambda-new-relic-license-key is not in configuration)
02:41:30.011 STDOUT terraform:   - resource "aws_secretsmanager_secret_version" "lambda-new-relic-license-key" {
02:41:30.011 STDOUT terraform:       - arn              = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:LAMBDA_NEW_RELIC_LICENSE_KEY-T1PN3G" -> null
02:41:30.011 STDOUT terraform:       - id               = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:LAMBDA_NEW_RELIC_LICENSE_KEY-T1PN3G|terraform-20251001205018508700000002" -> null
02:41:30.011 STDOUT terraform:       - region           = "ca-central-1" -> null
02:41:30.011 STDOUT terraform:       - secret_id        = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:LAMBDA_NEW_RELIC_LICENSE_KEY-T1PN3G" -> null
02:41:30.012 STDOUT terraform:       - secret_string    = (sensitive value) -> null
02:41:30.012 STDOUT terraform:       - secret_string_wo = (write-only attribute) -> null
02:41:30.012 STDOUT terraform:       - version_id       = "terraform-20251001205018508700000002" -> null
02:41:30.012 STDOUT terraform:       - version_stages   = [
02:41:30.012 STDOUT terraform:           - "AWSCURRENT",
02:41:30.012 STDOUT terraform:         ] -> null
02:41:30.012 STDOUT terraform:         # (1 unchanged attribute hidden)
02:41:30.012 STDOUT terraform:     }
02:41:30.012 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
02:41:30.012 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
02:41:30.012 STDOUT terraform:       ~ id       = "5687607798207096628" -> (known after apply)
02:41:30.012 STDOUT terraform:       ~ triggers = { # forces replacement
02:41:30.012 STDOUT terraform:           ~ "always_run" = "2025-10-02T15:51:22Z" -> (known after apply)
02:41:30.012 STDOUT terraform:         }
02:41:30.012 STDOUT terraform:     }
02:41:30.012 STDOUT terraform: Plan: 1 to add, 4 to change, 3 to destroy.
02:41:30.012 STDOUT terraform: Warning: Argument is deprecated
02:41:30.012 STDOUT terraform:   with module.signoz_api_lambda_logs.aws_s3_bucket.this,
02:41:30.012 STDOUT terraform:   on .terraform/modules/signoz_api_lambda_logs/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
02:41:30.012 STDOUT terraform:    8: resource "aws_s3_bucket" "this" {
02:41:30.012 STDOUT terraform: server_side_encryption_configuration is deprecated. Use the
02:41:30.012 STDOUT terraform: aws_s3_bucket_server_side_encryption_configuration resource instead.
02:41:30.012 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
02:41:30.012 STDOUT terraform: Saved the plan to: plan.tfplan
02:41:30.012 STDOUT terraform: To perform exactly these actions, run the following command to apply:
02:41:30.012 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
